# Basic SQL queries (SQLite)

In [1]:
import sqlite3
import pandas as pd

In [2]:
%load_ext sql

In [3]:
# create a database
conn = sqlite3.connect("database.db")

In [4]:
%sql sqlite:///database.db

In [5]:
%%sql

DROP TABLE INSTRUCTOR;

 * sqlite:///database.db
(sqlite3.OperationalError) no such table: INSTRUCTOR
[SQL: DROP TABLE INSTRUCTOR;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [6]:
%%sql

CREATE TABLE INSTRUCTOR
    (ins_id INTEGER PRIMARY KEY NOT NULL, 
     lastname VARCHAR(15) NOT NULL, 
     firstname VARCHAR(15) NOT NULL, 
     city VARCHAR(15), 
     country CHAR(2)
    );

 * sqlite:///database.db
Done.

[]

In [7]:
%%sql

INSERT INTO INSTRUCTOR
    (ins_id, lastname, firstname, city, country)
    VALUES 
        (1, 'Ahuja', 'Rav', 'Toronto', 'CA'),
        (2, 'Chong', 'Raul', 'Toronto', 'CA'),
        (3, 'Vasudevan', 'Hima', 'Chicago', 'US');

 * sqlite:///database.db
3 rows affected.

[]

In [8]:
%%sql 

SELECT * FROM INSTRUCTOR

 * sqlite:///database.db
Done.

[(1, 'Ahuja', 'Rav', 'Toronto', 'CA'),
 (2, 'Chong', 'Raul', 'Toronto', 'CA'),
 (3, 'Vasudevan', 'Hima', 'Chicago', 'US')]

In [9]:
%%sql

SELECT firstname, lastname, country from INSTRUCTOR where city='Toronto'

 * sqlite:///database.db
Done.

[('Rav', 'Ahuja', 'CA'), ('Raul', 'Chong', 'CA')]

In [10]:
%%sql

UPDATE INSTRUCTOR SET city='Markham' where ins_id=1

 * sqlite:///database.db
1 rows affected.

[]

In [11]:
%%sql

SELECT * FROM INSTRUCTOR

 * sqlite:///database.db
Done.

[(1, 'Ahuja', 'Rav', 'Markham', 'CA'),
 (2, 'Chong', 'Raul', 'Toronto', 'CA'),
 (3, 'Vasudevan', 'Hima', 'Chicago', 'US')]

In [12]:
%%sql

DELETE FROM INSTRUCTOR where ins_id=2

 * sqlite:///database.db
1 rows affected.

[]

In [13]:
%%sql

SELECT * FROM INSTRUCTOR

 * sqlite:///database.db
Done.

[(1, 'Ahuja', 'Rav', 'Markham', 'CA'),
 (3, 'Vasudevan', 'Hima', 'Chicago', 'US')]

In [14]:
%%sql

INSERT INTO INSTRUCTOR
    (ins_id, lastname, firstname, city, country)
    VALUES 
        (5, 'Kim', 'Ting', 'PJ', 'MYS');

 * sqlite:///database.db
1 rows affected.

[]

In [15]:
conn.close()